{
  "profileAlternative": {
    "name": "Bruno Borges",
    "headline": "Principal Product Manager / Program Manager for Java Development at Microsoft",
    "imageurl": "https://media.licdn.com/dms/image/C4E03AQGnntKrGokZug/profile-displayphoto-shrink_200_200/0?e=1578528000&v=beta&t=OP7vn5bdO7pZYLMP1AKcBL8Q2VHyfPENBiDbKKjgpos",
    "location": "Vancouver, Canada Area",
    "connections": "500+",
    "summary": "Product and Program Management for Java Runtimes, Development Experiences, and Developer Relations at Microsoft Azure, building the best Cloud for Java workloads and Java developers."
  },
  "aboutAlternative": {
    "text": "Product and Program Management for Java Runtimes, Development Experiences, and Developer Relations at Microsoft Azure, building the best Cloud for Java workloads and Java developers."
  },
  "positions": [
    {
      "title": "Microsoft",
      "location": "Vancouver, Canada Area",
      "description": "Work together with the Core Java engineering team in the Microsoft Developer Division to optimize Java runtimes and tools for Azure services and internal customers.",
      "date1": "Oct 2019 – Present",
      "date2": "2 mos",
      "roles": [
        {
          "title": "Principal Product Manager / Program Manager",
          "date1": "Oct 2019 – Present",
          "date2": "2 mos",
          "location": "Vancouver, Canada Area"
        },
        {
          "title": "Principal Cloud Advocate Manager",
          "date1": "Feb 2018 – Present",
          "date2": "1 yr 10 mos",
          "location": "Vancouver, Canada Area"
        }
      ]
    },
    {
      "title": "Title\nPrincipal Product Manager / Program Manager",
      "location": "Vancouver, Canada Area",
      "description": "Work together with the Core Java engineering team in the Microsoft Developer Division to optimize Java runtimes and tools for Azure services and internal customers.",
      "date1": "Oct 2019 – Present",
      "date2": "2 mos",
      "roles": [
        {
          "title": "Principal Product Manager / Program Manager",
          "date1": "Oct 2019 – Present",
          "date2": "2 mos",
          "location": "Vancouver, Canada Area"
        }
      ]
    },
    {
      "title": "Title\nPrincipal Cloud Advocate Manager",
      "location": "Vancouver, Canada Area",
      "description": "Leads Developer Relations Strategy and a Developer Advocacy team for the Enterprise Application Development community in the Microsoft Azure DevRel group, aimed at .NET and Java developers. Together with Marketing and Engineering, designs and executes on projects for building relationship with the community of customers, partners, and developers to generate awareness and to gather valuable input for product improvements that will deliver up to date and modern developer experience for Azure services and Microsoft developer tools.\n…\nsee more",
      "date1": "Feb 2018 – Present",
      "date2": "1 yr 10 mos",
      "roles": [
        {
          "title": "Principal Cloud Advocate Manager",
          "date1": "Feb 2018 – Present",
          "date2": "1 yr 10 mos",
          "location": "Vancouver, Canada Area"
        }
      ]
    },
    {
      "title": "Oracle",
      "location": "Redwood City, CA",
      "description": "Worked as key influencer and leader of a virtual, multi-functional, cross organizational team to create, foster, and expedite activities to support developer relations, outreach and engagement, asset and guide product management and product marketing to identify the right tone, message, and content to expose Oracle technologies to developer communities. Worked closely with marketing events teams for major initiatives such as Oracle's own developer conferences (Oracle Code/JavaOne/OpenWorld/CloudWorld) and 3rd-party sponsorships, as well hackathons, meetups, and user grousps.\n\nContent chairman and curator of Oracle Code events call for papers (developer.oracle.com/code), Oracle Developers on Medium (medium.com/oracledevs), and overall content strategy of Oracle Developers portal (developer.oracle.com). Worked actively with social media team, driving fast growth and strong presence on Twitter/Facebook (@oracledevs).\n\nOwned the governance of Oracle accounts on GitHub, npmjs.com, RubyGems, Docker Hub and others, to ensure consistency and cohesive structure over published assets, leading discussions with Legal departments for proper external Open Source engagement, and content quality with common best practices for open source activities. Led engineering teams from different products, and directly contributed to Oracle's Docker Images initiative (github.com/oracle/docker-images; developer.oracle.com/docker).\n\nInfluenced Oracle Cloud enhancements toward the developer persona, driving the vision of Oracle Cloud's Guided Journey, the first encounter new Oracle Cloud users hit on their first sign in, aimed at helping users to learn about Oracle Cloud's main capabilities, get them up to speed and experiment quickly and successfully many of Oracle Cloud's application development services. Also involved in user and developer experience discussions, bringing the best of the outside world point-of-view and representing the developer community.\n…\nsee more",
      "date1": "Sep 2015 – Jan 2018",
      "date2": "2 yrs 5 mos",
      "roles": [
        {
          "title": "Principal Product Manager - Developer Relations Strategy, 3rd-party Sites Governance, Dev Experience",
          "date1": "Sep 2015 – Jan 2018",
          "date2": "2 yrs 5 mos",
          "location": "Redwood City, CA"
        },
        {
          "title": "Principal Product Manager & Developer Advocate for LAD",
          "date1": "Jun 2012 – Aug 2015",
          "date2": "3 yrs 3 mos",
          "location": "São Paulo Area, Brazil"
        }
      ]
    },
    {
      "title": "Title\nPrincipal Product Manager - Developer Relations Strategy, 3rd-party Sites Governance, Dev Experience",
      "location": "Redwood City, CA",
      "description": "Worked as key influencer and leader of a virtual, multi-functional, cross organizational team to create, foster, and expedite activities to support developer relations, outreach and engagement, asset and guide product management and product marketing to identify the right tone, message, and content to expose Oracle technologies to developer communities. Worked closely with marketing events teams for major initiatives such as Oracle's own developer conferences (Oracle Code/JavaOne/OpenWorld/CloudWorld) and 3rd-party sponsorships, as well hackathons, meetups, and user grousps.\n\nContent chairman and curator of Oracle Code events call for papers (developer.oracle.com/code), Oracle Developers on Medium (medium.com/oracledevs), and overall content strategy of Oracle Developers portal (developer.oracle.com). Worked actively with social media team, driving fast growth and strong presence on Twitter/Facebook (@oracledevs).\n\nOwned the governance of Oracle accounts on GitHub, npmjs.com, RubyGems, Docker Hub and others, to ensure consistency and cohesive structure over published assets, leading discussions with Legal departments for proper external Open Source engagement, and content quality with common best practices for open source activities. Led engineering teams from different products, and directly contributed to Oracle's Docker Images initiative (github.com/oracle/docker-images; developer.oracle.com/docker).\n\nInfluenced Oracle Cloud enhancements toward the developer persona, driving the vision of Oracle Cloud's Guided Journey, the first encounter new Oracle Cloud users hit on their first sign in, aimed at helping users to learn about Oracle Cloud's main capabilities, get them up to speed and experiment quickly and successfully many of Oracle Cloud's application development services. Also involved in user and developer experience discussions, bringing the best of the outside world point-of-view and representing the developer community.\n…\nsee more",
      "date1": "Sep 2015 – Jan 2018",
      "date2": "2 yrs 5 mos",
      "roles": [
        {
          "title": "Principal Product Manager - Developer Relations Strategy, 3rd-party Sites Governance, Dev Experience",
          "date1": "Sep 2015 – Jan 2018",
          "date2": "2 yrs 5 mos",
          "location": "Redwood City, CA"
        }
      ]
    },
    {
      "title": "Title\nPrincipal Product Manager & Developer Advocate for LAD",
      "location": "São Paulo Area, Brazil",
      "description": "Worked as Latin America (LAD) Outbound Principal Product Manager for Oracle FMW, Cloud and Java, responsible for outbound activities such as Sales Enablement of representatives and technical consultants, customers visits, marketing events, support leadership for escalated and highly critical situations, sales strategy and sales plays contribution, and field feedback for inbound Product Management teams. Focused on all things Oracle Cloud and Java.\n\nWas directly Involved with inbound CAF PM team, delivering the technical solution for certifying WebLogic Server under the new virtualization platform Docker. Constant feedback and contributions to Oracle Cloud services, and several other internal contributions and discussion engagements.\n\nWorked as Developer Advocate, responsible to advocate Oracle FMW, Cloud, and Java products, mostly for developers interested in Middleware solutions, such as the Java EE Platform and Cloud technologies. Collaborating with the Java EE Evangelism team by engaging with the Latin America community. Also collaborating with Java SE, JavaFX, and Nashorn/JVM evangelism across JUGs and Java conferences worldwide. Longstanding relationship with the Product Marketing and OTN teams giving assistance for Marketing strategies, community outreach, and events participation. Good relationship with Oracle User Groups, delivering Middleware and Java content at OUGs worldwide, such as OTN Latin America Tour (2013/2014), OUG Norway 2014.\n…\nsee more",
      "date1": "Jun 2012 – Aug 2015",
      "date2": "3 yrs 3 mos",
      "roles": [
        {
          "title": "Principal Product Manager & Developer Advocate for LAD",
          "date1": "Jun 2012 – Aug 2015",
          "date2": "3 yrs 3 mos",
          "location": "São Paulo Area, Brazil"
        }
      ]
    },
    {
      "title": "Startup CTO and Co-founder",
      "companyName": "Comprei e Não Vou",
      "description": "Worked as developer for the technical side of the startup, as well as business developer to bring a monetization model. This startup's vision aims to solve the problem of ticket reselling and the secondary market.",
      "date1": "Oct 2011 – Jul 2012",
      "date2": "10 mos"
    },
    {
      "title": "Principal Java Architect, Team Leader",
      "companyName": "Bemobi",
      "location": "Rio de Janeiro Area, Brazil",
      "description": "Architectured and led a team of developers to build a Middleware solution for a high speed delivery mechanism of paid SMS text messages to a telecom company. Used Open Source Java technologies for easy Cloud deployment as part of future roadmap. Several Apache projects used in this solution, such as ActiveMQ, Camel, and CXF. Also used Spring Framework and JBoss AS.",
      "date1": "May 2012 – Jun 2012",
      "date2": "2 mos"
    },
    {
      "title": "Principal Java Developer",
      "companyName": "Cast IT Group",
      "location": "Rio de Janeiro Area, Brazil",
      "description": "Architected and developed a web application to allow citizens to schedule hearings for state tax review. Used leading industry standards and frameworks (Java EE and Spring), jQuery libraries, and Oracle products (DB and WebLogic).",
      "date1": "Jan 2012 – May 2012",
      "date2": "5 mos"
    },
    {
      "title": "Software Architect",
      "companyName": "wdev",
      "location": "Rio de Janeiro Area, Brazil",
      "description": "Architected and implemented a custom framework to be used as base implementation for actual IT projects. Goal was to have a single standard for all projects. Used several Apache frameworks, that combined and integrated together helped more than 30 teams of developers. Also delivered training and consultancy for integrating modern solutions with legacy Mainframe systems.",
      "date1": "Oct 2010 – Oct 2011",
      "date2": "1 yr 1 mo"
    },
    {
      "title": "CTO/Software Engineer",
      "companyName": "Neociclo",
      "description": "Architected, developed and documented part of the Accord MFT suite based on the following technologies: Apache Camel, Apache ServiceMix, Apache Maven and Apache MINA.",
      "date1": "Apr 2010 – May 2011",
      "date2": "1 yr 2 mos"
    },
    {
      "title": "Senior Developer",
      "companyName": "CETIP",
      "description": "Open Source software consulting, development of Java software to replace legacy code. Improvements in the development process with Agile Development adoption. Build script development and framework enhancements.",
      "date1": "Apr 2008 – Apr 2010",
      "date2": "2 yrs 1 mo"
    },
    {
      "title": "Senior Java Developer",
      "companyName": "Summa Technologies do Brasil",
      "description": "Analysis and development of new financial products as well the migration of older functionalities. These modules were developed using CETIP's proprietary framework for web applications, batch operations and business solutions. Leading ORM solution, Hibernate, was part of it. Code standards and Oracle database knowledge was required",
      "date1": "Apr 2006 – Apr 2008",
      "date2": "2 yrs 1 mo"
    },
    {
      "title": "Senior Java Developer",
      "companyName": "EDS do Brasil",
      "description": "Worked helping teams going through common Java problems and also on building and integrating use cases developed by outsourced teams. Had a strong participation on database design, architectural decisions and infrastructure optimization. Developed dozens of CRUD web interface use cases for a big customer of EDS.",
      "date1": "Dec 2003 – Apr 2006",
      "date2": "2 yrs 5 mos"
    },
    {
      "title": "Java Developer",
      "companyName": "Sensys Consultoria",
      "description": "Development of a workflow module with the JGraph project. Also introduced a tooling environment with Eclipse, JBoss IDE and xDoclet to easily develop EJB 2.x components. Designed several build scripts in Apache Ant for automating repetitive tasks.",
      "date1": "Aug 2003 – Dec 2003",
      "date2": "5 mos"
    },
    {
      "title": "Java Developer",
      "companyName": "Virtuem Informática",
      "description": "Migrated a Delphi application to Java EE, totally web. Developed specialized modules like calendar and reports. Deployed the application directly into main customers' environments.",
      "date1": "Mar 2002 – Aug 2003",
      "date2": "1 yr 6 mos"
    },
    {
      "title": "Java Developer",
      "companyName": "Lógica Sistemas Informática",
      "location": "Florianópolis Area, Brazil",
      "description": "Developed a Java desktop interface with Java Swing for a Labour Lawsuit control system designed for Regional Labour Courts. Used the Oracle suite including JDeveloper and BC4J.\nPioneered on a Web interface with plain JSP, Servlets and Taglibs.",
      "date1": "Jul 2001 – Jan 2002",
      "date2": "7 mos"
    }
  ],
  "educations": [
    {
      "title": "Universidade do Vale do Itajaí",
      "degree": "Computer Science",
      "fieldofstudy": "Computer Science",
      "date1": "2003",
      "date2": "2004"
    }
  ],
  "skills": [
    {
      "title": "Cloud Computing",
      "count": "42"
    },
    {
      "title": "Open Source",
      "count": "24"
    },
    {
      "title": "Software Development",
      "count": "55"
    }
  ],
  "recommendations": {
    "givenCount": "19",
    "receivedCount": "29",
    "given": [
      {
        "user": "https://www.linkedin.com/in/jonathangiles/",
        "text": "Bruno was my manager for around 10 months in the cloud developer advocacy organisation at Microsoft, where we focused on Java and Azure. Bruno has a great combination of technical expertise, management know-how, marketplace insight, and community thought leadership. It was a delight working with him, and any organisation that is lucky enough to entice him to join them will be the better for it.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/riferrei/",
        "text": "I worked with Bruno for almost a year at Oracle Brazil and I could witness how good he can be while working as Product Manager for Java-based products such as WebLogic, Coherence, Exalogic. He also work hard in the community to elevate Java to the next level. One of the few guys at Oracle Brazil that really understands Java in a reasonable level to effectively sustain a technical conversation with customers.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/danielaraujo/",
        "text": "Bruno é um profissional competente e determinado. Tem profundo conhecimento técnico e está sempre atualizado com novas tecnologias. Sua perseverança em projetos é motivadora."
      },
      {
        "user": "https://www.linkedin.com/in/mchristianini/",
        "text": "Bruno has become a trusted advisor for most of our largest, strategic customers as well as with the developer community. His brilliant work as a Product Manager has changed much of the local culture of Oracle for more innovation and creativity, while helping the company and customers to be more sucessfull."
      },
      {
        "user": "https://www.linkedin.com/in/cameronpurdy/",
        "text": "My team has been working closely with Bruno for a few years now at Oracle. Bruno is a self-starter; for example, he jumped in blindly to prototype Docker support with our product line, and quickly delivered a working Proof of Concept. He's smart, technically savvy, a quick learner, and he sees things through to completion."
      },
      {
        "user": "https://www.linkedin.com/in/felipepontes/",
        "text": "Bruno is a great speaker, very aligned with technical changes and ahead of many. Committed to do his best in every initiative and with good disruptive ideas showing himself as an outstanding evangelist. I am very glad that I could count with Bruno to support my team and my customers (ISVs)"
      },
      {
        "user": "https://www.linkedin.com/in/shaunmsmith/",
        "text": "Bruno's deep technical expertise, unbridled enthusiasm and curiosity, and his ability to connect with people on a personal level make him an invaluable teammate. Never content with the status quo, Bruno is always looking for how products can be improved. His drive is impossible to contain and I'm glad that's the case because whether I’m collaborating with him on product evolution or new product development the end results will be better when he’s involved.\n…\nSee more"
      }
    ],
    "received": [
      {
        "user": "https://www.linkedin.com/in/jonathangiles/",
        "text": "When at Microsoft Jonathan reported to my team, he performed every assigned task flawlessly, on time and with high quality, pulling whoever was needed to move forward and remove any blocks. In times there was no task assigned, Jonathan demonstrated solid and well-reasoned initiatives that delivered high impact and great outcome for the business, aligned with the overall strategy. His experience in the Java ecosystem is the best in class, and I strongly recommend him to any engineering position, including leading teams and major projects."
      },
      {
        "user": "https://www.linkedin.com/in/costlow/",
        "text": "Erik has a great understanding of everything underlying major Cloud and SaaS environments. We were on different teams but he was a great sounding board for a number of our Cloud-based initiatives, especially those involving security, encryption, and performance."
      }
    ]
  },
  "accomplishments": [
    {
      "count": "3",
      "items": [
        "Java Champion",
        "Top Java Influencer of 2017",
        "Top Java Influencer 2016"
      ]
    },
    {
      "count": "3",
      "items": [
        "English",
        "Portuguese",
        "Spanish"
      ]
    },
    {
      "count": "3",
      "items": [
        "Comprei e Não Vou",
        "BlocoDroid",
        "Certification of WebLogic 12c on Docker"
      ]
    },
    {
      "count": "2",
      "items": [
        "Java",
        "Pascal Programming"
      ]
    }
  ],
  "peopleAlsoViewed": [],
  "volunteerExperience": [
    {
      "title": "Contributor",
      "experience": "The Apache Software Foundation",
      "description": "Science and Technology",
      "date1": "Jan 2009 – Dec 2011",
      "date2": "3 yrs"
    }
  ],
  "profile": {
    "name": "Bruno Borges",
    "headline": "Principal Product Manager / Program Manager for Java Development at Microsoft",
    "imageurl": "https://media.licdn.com/dms/image/C4E03AQGnntKrGokZug/profile-displayphoto-shrink_200_200/0?e=1578528000&v=beta&t=OP7vn5bdO7pZYLMP1AKcBL8Q2VHyfPENBiDbKKjgpos",
    "location": "Vancouver, Canada Area",
    "connections": "500+",
    "summary": "Product and Program Management for Java Runtimes, Development Experiences, and Developer Relations at Microsoft Azure, building the best Cloud for Java workloads and Java developers."
  }
}