{
  "profileAlternative": {
    "name": "Jason Chen",
    "headline": "@MongoDB",
    "imageurl": "https://media.licdn.com/dms/image/C4D03AQHcOpbSo5ekRQ/profile-displayphoto-shrink_200_200/0?e=1578528000&v=beta&t=8-5rYbjRVZ2U9MU2dHj_aN12WPv0cxR7RrbDQTwFP04",
    "location": "Greater New York City Area",
    "connections": "500+",
    "summary": "Pronouns: he, him, his\n\n\"Greatness is never achieved alone. Surround yourself with good people. A quality team. Set your mark... and raise the bar.\""
  },
  "aboutAlternative": {
    "text": "Pronouns: he, him, his\n\n\"Greatness is never achieved alone. Surround yourself with good people. A quality team. Set your mark... and raise the bar.\""
  },
  "positions": [
    {
      "title": "Senior Manager, Recruiting",
      "companyName": "MongoDB",
      "location": "Greater New York City Area",
      "description": "I am currently overseeing Technical and Corporate recruiting efforts for North America and EMEA.\n\nCurious to see what it’s like to work here? Check out our blog @ https://www.mongodb.com/blog/channel/culture\n\nOur Core Values:\n- Think Big, Go Far.\n- Make It Matter.\n- Build Together.\n- Embrace the Power of Differences.\n- Be Intellectually Honest.\n- Own What You Do.\n…\nsee more",
      "date1": "Mar 2013 – Present",
      "date2": "6 yrs 9 mos"
    },
    {
      "title": "Recruiter (Lead Tech Recruitment)",
      "companyName": "J.Crew",
      "location": "Greater New York City Area",
      "date1": "Feb 2012 – Mar 2013",
      "date2": "1 yr 2 mos"
    },
    {
      "title": "Technical Recruiter",
      "companyName": "Gilt.com",
      "location": "Greater New York City Area",
      "description": "Talent Acquisition - Gilt Groupe (Tech) / Jetsetter (Tech & Corporate)",
      "date1": "Feb 2011 – Feb 2012",
      "date2": "1 yr 1 mo"
    },
    {
      "title": "Sports and Arts in Schools Foundation",
      "location": "Brooklyn",
      "date1": "Jun 2009 – Feb 2011",
      "date2": "1 yr 9 mos",
      "roles": [
        {
          "title": "Program Director, John Ericsson Middle School 126",
          "date1": "Jun 2009 – Feb 2011",
          "date2": "1 yr 9 mos",
          "location": "Brooklyn"
        },
        {
          "title": "Student Advisor",
          "date1": "Jun 2009 – Feb 2010",
          "date2": "9 mos"
        }
      ]
    },
    {
      "title": "Title\nProgram Director, John Ericsson Middle School 126",
      "location": "Brooklyn",
      "date1": "Jun 2009 – Feb 2011",
      "date2": "1 yr 9 mos",
      "roles": [
        {
          "title": "Program Director, John Ericsson Middle School 126",
          "date1": "Jun 2009 – Feb 2011",
          "date2": "1 yr 9 mos",
          "location": "Brooklyn"
        }
      ]
    },
    {
      "title": "Title\nStudent Advisor",
      "date1": "Jun 2009 – Feb 2010",
      "date2": "9 mos",
      "roles": [
        {
          "title": "Student Advisor",
          "date1": "Jun 2009 – Feb 2010",
          "date2": "9 mos"
        }
      ]
    },
    {
      "title": "Special Events Coordinator",
      "companyName": "American Cancer Society",
      "date1": "Mar 2008 – Jun 2009",
      "date2": "1 yr 4 mos"
    }
  ],
  "educations": [
    {
      "title": "State University of New York at Binghamton",
      "degree": "Bachelor of Science",
      "fieldofstudy": "Human Development - Community and Public Affairs"
    }
  ],
  "skills": [
    {
      "title": "Technical Recruiting",
      "count": "64"
    },
    {
      "title": "Recruiting",
      "count": "59"
    },
    {
      "title": "Internet Recruiting",
      "count": "40"
    }
  ],
  "recommendations": {
    "givenCount": "0",
    "receivedCount": "72",
    "given": [
      {
        "user": "https://www.linkedin.com/in/joseph-caswell-551643139/",
        "text": "If it is possible to over-communicate, Jason is doing it! Throughout the entire process from first contact to hired, I never had to wonder what was next, or when I would be hearing back - he ensured I already knew. The world could definitely use more recruiters like this."
      },
      {
        "user": "https://www.linkedin.com/in/holly-barnett/",
        "text": "Jason is by far the best recruiter I have ever worked with. Throughout the entire hiring process Jason was incredibly courteous, patient, and informative. The hiring process was unbelievably smooth thanks to Jason’s exemplary skills. His knowledge base and willingness to help in any way he could was unlike anything I’ve experienced with other recruiters. Jason most certainly made a massive impact on my decision to move forward with the job offer and I will forever be grateful.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/lenny-zatulovsky/",
        "text": "Jason guided me through a very smooth hiring process. He was honest, invested, and fully transparent about the process. I received great advice and multiple check-ins throughout. Jason was an absolute pleasure to work with and I would highly recommend him."
      },
      {
        "user": "https://www.linkedin.com/in/leolin04/",
        "text": "Jason is the best recruiter and HR I have known of. He is very transparent and works at your behalf, and he is a super nice guy! I am highly recommend Jason to anyone whom is looking for a new adventure at MongoDB."
      },
      {
        "user": "https://www.linkedin.com/in/mariano-escribano-16818357/",
        "text": "Jason fought for me down to the last minute and eventually steered me towards a new company where I couldn't be happier. His quick work and detailed explanations helped me navigate a very stressful day where I had competing offers and had to make a decision with a lot on the balance. His follow-up and guidance on things even after the deal was sealed has also been much appreciated, but more importantly it goes to show his investment in the person and the whole process. Kudos to Jason!\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/waddingham/",
        "text": "Jason was a fantastic recruiter who guided me through the entire interview process at MongoDB very deftly. He was always available to answer any questions and helped ensure my travel for onsite interviews went off without a hitch. I would recommend Jason as a recruiter unreservedly."
      },
      {
        "user": "https://www.linkedin.com/in/andrewjasonwalsh/",
        "text": "Jason is an exceptional recruiter, his guidance was integral to my hiring process. A normally confusing and unnerving process was made immensely easier by Jason's commitment to consistently communicating with candidates. His communications were always quick and exceedingly honest. His candor was very appreciated and allowed me to feel more comfortable as I went on to conduct a trip out for an onsite. Mr. Chen's knowledge, tact, professionalism and candor are a credit to MongoDB. I am very glad to have had the opportunity to work with Jason and look forward to continued interactions in the future.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/tanlaw/",
        "text": "Jason was my recruiter at MongoDB. He was very personable, and was always upfront about everything. He answered all my questions and he also followed up to make sure I was being taken cared of. I'm glad MongoDB has Jason because with him around, I feel confident that MongoDB will continue to attract top talents."
      },
      {
        "user": "https://www.linkedin.com/in/tao-lin-023a5a31/",
        "text": "Jason is without doubt the best recruiter, I have ever worked with. I really enjoyed interacting with Jason and very impressed by Jason's professionalism. I highly recommend him to anyone who wants to explore an opportunity outside their work."
      },
      {
        "user": "https://www.linkedin.com/in/jeffyoungtechleader/",
        "text": "Jason's organization and communications skills helped to make the process as seamless and comfortable as possible from the candidate perspective. Jason concisely conveyed the necessary information and expectations that a candidate needed to navigate the interviewing logistics at a distributed organization. He maintained the intricate balance between protecting the organization's recruiting interests as well as looking out for the candidate in an extraordinarily professional manner.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/chris-cunningham-30695720/",
        "text": "Jason Chen recruited me into MongoDB and made the entire process clear and concise. He would always keep me up to date on the progress of my application and what the next steps would be, making the necessary introductions each step of the way. His personality and professionalism make him one of the best recruiters I have ever worked with.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/brian-inocencio/",
        "text": "I can't say I can recall another recruitment process that went as smoothly as the one Jason ran for me with MongoDB. He stayed in regular contact, and always stuck to the timeframe estimates he gave me - even when he didn't have the answers yet. The biggest thing to me was his transparency. Jason always kept me informed on where I stood during the process, which I really appreciated. I felt comfortable working with him from the very beginning.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/lorneschachter/",
        "text": "Jason really ran the process smoothly, keeping me informed from step to step and always letting me know what to expect. No surprises and he moved things very quickly, a real pleasure to work with."
      },
      {
        "user": "https://www.linkedin.com/in/edward-liu-94844812/",
        "text": "Jason was awesome to work with on the entire process of my job search with MongoDB. He was very prompt and responsive, and I really appreciated him going above and beyond to ensure that I knew where I stood in the process. He made the process very seamless and smooth for me, and it was a pleasure to work with him to get my job at MongoDB.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/byunggyuahn/",
        "text": "Jason is a great recruiter who have your best interest in mind when you are working with him. I worked with him and he worked hard to have me get what I wanted. I highly recommend him to any person who wants to explore an opportunity outside their work."
      },
      {
        "user": "https://www.linkedin.com/in/roy-rim-3b065717/",
        "text": "Jason Chen was in charge of my interview process. I've been through several interviews recently and Jason really made the process clear and straight forward and even forgiving (apparently they plan for a little lateness) when I was late due to train delays. Jason answered most of my questions about MongoDB and was also clear about the expectations the position I was interviewing for had. Throughout the entire hiring process he kept me in the know via email and phone calls and even after I was hired he kept in touch to make sure things were proceeding well for me. I would highly recommend Jason Chen.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/jaygordon0042/",
        "text": "A small anecdote before the meat of this recommendation: I get an email asking for a phone call, it's Jason. He and I had already done a preliminary phone screen and discussed many of my interests for the future. When he saw an opportunity for me to excel somewhere, he decided it was time to change the discussion and move me to a role that wasn't what I originally applied for because he saw there was a real ability for me to grow. It's a special recruiter that knows you after just a few minutes and can visualize your success. As a technology professional, you tend to come in contact with many of the people who source talent all the time. Jason and I began a passive interaction years ago that eventually lead to me really believing in him and MongoDB. Jason brought me through the process of interviewing, negotiation and eventually finalization without me once thinking anything negative. A true professional in his field and someone more people should mold themselves as. My greatest regret is that all the times Jason and I interacted on LinkedIn in the past, I did not respond sooner. He's really helped me make sure I am set up for success.\n…\nSee more"
      }
    ],
    "received": []
  },
  "accomplishments": [],
  "peopleAlsoViewed": [],
  "volunteerExperience": [],
  "profile": {
    "name": "Jason Chen",
    "headline": "@MongoDB",
    "imageurl": "https://media.licdn.com/dms/image/C4D03AQHcOpbSo5ekRQ/profile-displayphoto-shrink_200_200/0?e=1578528000&v=beta&t=8-5rYbjRVZ2U9MU2dHj_aN12WPv0cxR7RrbDQTwFP04",
    "location": "Greater New York City Area",
    "connections": "500+",
    "summary": "Pronouns: he, him, his\n\n\"Greatness is never achieved alone. Surround yourself with good people. A quality team. Set your mark... and raise the bar.\""
  }
}