{
  "profileAlternative": {
    "name": "JT Haskell",
    "headline": "Director of Recruiting at Zapier - on parental leave until January but will get back to you ASAP.",
    "imageurl": "https://media.licdn.com/dms/image/C4E03AQGF5G0CwaHShA/profile-displayphoto-shrink_200_200/0?e=1578528000&v=beta&t=KwGE1mCpIWzF8u83hNLBSxexQrpsm5EecHJ_tRl9GUA",
    "location": "Atlanta, Georgia",
    "connections": "500+",
    "summary": "Experienced talent acquisition leader building industry-leading software companies in security, cloud, machine learning, and mobile. Expert in sourcing, executive search, technical recruiting, and building high-performing, global, recruiting teams. Strong human resources, immigration, and employment law experience. Passionate about candidate experience and delivering for hiring managers."
  },
  "aboutAlternative": {
    "text": "Experienced talent acquisition leader building industry-leading software companies in security, cloud, machine learning, and mobile. Expert in sourcing, executive search, technical recruiting, and building high-performing, global, recruiting teams. Strong human resources, immigration, and employment law experience. Passionate about candidate experience and delivering for hiring managers."
  },
  "positions": [
    {
      "title": "Director of Recruiting",
      "companyName": "Zapier",
      "location": "Greater Atlanta Area",
      "description": "We're a 100% remote team living and working all over the world to help you automate the most tedious parts of your day to day job.",
      "date1": "Jul 2018 – Present",
      "date2": "1 yr 5 mos"
    },
    {
      "title": "Director of Talent Acquisition",
      "companyName": "Pindrop",
      "location": "Greater Atlanta Area",
      "description": "Some of what I was doing:\n- Directed global recruiting team and operations responsible for Pindrop's expansion across all business units and university programs\n- Interview training and development optimization as we scale\n- Employment branding and engagement\n- Constantly hacked new automated sourcing and outreach methods to quickly build pipelines\n- Increasing our interviewing efficiency for an incredible candidate experience for both our teams and candidates\n- International hiring, legal, and vendor management\n- Responsible for administering Greenhouse ATS and performance analytics\n- Responsible for executive and other senior-level searches\n…\nsee more",
      "date1": "Nov 2015 – Jul 2018",
      "date2": "2 yrs 9 mos"
    },
    {
      "title": "Market Manager",
      "companyName": "Hired, Inc.",
      "description": "",
      "date1": "Apr 2015 – Nov 2015",
      "date2": "8 mos"
    },
    {
      "title": "Talent Acquisition Lead",
      "companyName": "AirWatch by VMware",
      "location": "Atlanta, GA",
      "description": "Talent Acquisition team lead focused across the entire business. Later, lead the expansion of the R&D and Engineering teams from 50 to 650 globally. AirWatch grew from 180 to 2,200 employees globally during my three years there with a small but strong team of recruiters. AirWatch was acquired by VMware in 2014 for $1.5B.",
      "date1": "Mar 2012 – Mar 2015",
      "date2": "3 yrs 1 mo"
    },
    {
      "title": "Talent Acquisition Manager",
      "companyName": "Cobalt Talon",
      "description": "Cobalt Talon was a startup that built a PaaS analytics product specific to the healthcare payer industry.\n\nManaged full life cycle recruiting including HR responsibilities of on boarding, benefits and immigration.\nDeveloped operational processes, sourcing strategies and talent pipelines.\nImplemented a careers page and employment banding strategy.\nAssisted with opening of the corporate headquarters.\nRecruited in-house operational teams, product development and hosting operations with the following skills. Architects, software engineers, infrastructure engineers, QA, ETL and customer support, Teradata, MicroStrategy, QlikView, Talend, Hadoop.\n…\nsee more",
      "date1": "Aug 2011 – Mar 2012",
      "date2": "8 mos"
    },
    {
      "title": "Talent Acquisition Manager",
      "companyName": "Nokia",
      "location": "Greater Atlanta Area, Boston, Chicago, Montreal, Toronto, Raleigh",
      "description": "Recruited and managed recruitment operations for eastern US and Canada across 11 sites. Team consisted of recruiters, recruiting coordinators, and a project manager.\nLead recruitment for Nokia smart devices (acquired by Microsoft $7.2B) and location services (acquired by German auto group $2.71B).\nSuccess integration of multiple acquisitions for the internet services division including Plum, Metacarta, and Novarra.\nNorth / South America Project Manager for SuccessFactors ATS implementation.\nContinued to expand Nokia's presence and participation with universities, conferences and local user groups.\nRecruited new organizations in cloud services, semantic web, data analytics, mobile applications services, developer operations (DevOps), location based services (LBS) and all other business operations positions (HR, sales, finance).\n…\nsee more",
      "date1": "Sep 2007 – Aug 2011",
      "date2": "4 yrs"
    },
    {
      "title": "Technical Recruiter",
      "companyName": "The People Network",
      "date1": "Dec 2006 – Sep 2008",
      "date2": "1 yr 10 mos"
    },
    {
      "title": "Lead Recruiter",
      "companyName": "iSymmetry",
      "date1": "Aug 2005 – Dec 2006",
      "date2": "1 yr 5 mos"
    }
  ],
  "educations": [
    {
      "title": "Georgia State University",
      "degree": "Computer Information Systems",
      "fieldofstudy": "Computer Information Systems"
    }
  ],
  "skills": [
    {
      "title": "Talent Acquisition",
      "count": "99+"
    },
    {
      "title": "Technical Recruiting",
      "count": "99+"
    },
    {
      "title": "Recruiting",
      "count": "99+"
    }
  ],
  "recommendations": {
    "givenCount": "5",
    "receivedCount": "5",
    "given": [
      {
        "user": "https://www.linkedin.com/in/robdozier/",
        "text": "JT quickly became indispensable in finding and landing technical talent for our 24/7 hosting operations team. His ability to understand the demands of the roles, map those to quality candidates with current skills and cultural fit, and get them excited about joining our group, made hiring fast and easy for me. His knowledge of the business environment, competitive landscape, and potential sources of candidates meant we were able to craft roles and descriptions in a way that attracted truly great team members. I’ve had the opportunity to leverage JT’s help in multiple diverse hiring situations over several years. I would ask his help again for any new roles given the chance, and would specifically recommend him to anyone building a technical team.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/kristin-miller-corus360/",
        "text": "I had the opportunity to work closely with J.T. while he was our contract recruiter in Alpharetta. He is an exceptional recruiter that is well connected in the IT community. His strong technical knowledge allowed him to establish immediate repoire and credibility with managers and candidates. J.T. applied innovative sourcing and networking approaches to locate top-notch talent. He is an extremely self-motivated, high performer that I would highly recommend.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/jackbeaton/",
        "text": "JT is one of the most professional recruiters I've had the pleasure of working with. He demonstrated determination, reliability, promptness, and initiative. Whenever I asked a question, he would go find an answer, and without delay. When he linked me with Nokia, my current employer, the fact that Nokia chose such an efficient and dependable person as a first contact with potential employees was a definite factor in my decision to accept a position. It made Nokia stand out among other employers I have spoken with as having strong judgment in quality individuals, implying that my future coworkers would also be talented. I strongly recommend JT as a capable recruiter.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/aklepinger/",
        "text": "JT is a focused, organized, and friendly worker who is able to quickly and efficiently locate skilled candidates for technical positions. His technical know-how helps him identify talent and his people skills make working with him a pleasure. JT is an asset to any organization!"
      },
      {
        "user": "https://www.linkedin.com/in/jay-scott-a2a0752/",
        "text": "I had the pleasure of working with JT for almost a year. He was a great colleague and resource to have in the office. I had just started recruiting at the time I met JT and his training and assistance were critical to my success. He is an excellent recruiter and I would recommend him for any project."
      }
    ],
    "received": [
      {
        "user": "https://www.linkedin.com/in/joshclisby/",
        "text": "Josh quickly came up to speed with a complicated internal recruiting process at Nokia, that changed often. He proved time and again to take on the hardest to please hiring managers, set proper expectations and deliver. Some of the organizations he supported went through extensive transitions in both product and physical location changes. Yet Josh just pressed on with a great attitude while recruiting some rare talent for those teams. He is the type of contributor that doesn't require much in management. Give him an objective and he will establish and execute the plan to achieve it."
      },
      {
        "user": "https://www.linkedin.com/in/tessmanderson/",
        "text": "AirWatch has experienced incredible growth over the past year. Tess has been a patient and persistent recruiting partner in providing top talent during this time. She has succeeded in providing several key hires at the high level AirWatch pursues. She takes time to know our culture and re-target for the right candidate. Tess has consistently provided a pleasant and reliable service level that leaves no surprises. I have really enjoyed working with her and look forward to future collaboration!"
      }
    ]
  },
  "accomplishments": [],
  "peopleAlsoViewed": [
    {
      "user": "https://www.linkedin.com/in/maryhartberg/",
      "text": "Director of People Operations"
    },
    {
      "user": "https://www.linkedin.com/in/margaret-hellstrom/",
      "text": "People Operations at Zapier"
    },
    {
      "user": "https://www.linkedin.com/in/victoriavolvovski/",
      "text": "Senior Director of Product at Zapier"
    },
    {
      "user": "https://www.linkedin.com/in/erikaklics/",
      "text": "Recruiting & Diversity Initiatives at Zapier (she/her/hers)"
    },
    {
      "user": "https://www.linkedin.com/in/bryanhelmig/",
      "text": "CTO/Co-founder at Zapier"
    },
    {
      "user": "https://www.linkedin.com/in/codyjayjones/",
      "text": "Head of Partnerships at Zapier (We're Hiring!)"
    },
    {
      "user": "https://www.linkedin.com/in/wadefoster/",
      "text": "Co-founder & CEO at Zapier, YC & Mizzou Alum"
    },
    {
      "user": "https://www.linkedin.com/in/kenyonsparks/",
      "text": "Customer Champion at Zapier"
    },
    {
      "user": "https://www.linkedin.com/in/douggaff/",
      "text": "VP of Engineering at Zapier"
    },
    {
      "user": "https://www.linkedin.com/in/lisaleff/",
      "text": "Director of Recruiting"
    }
  ],
  "volunteerExperience": [],
  "profile": {
    "name": "JT Haskell",
    "headline": "Director of Recruiting at Zapier - on parental leave until January but will get back to you ASAP.",
    "imageurl": "https://media.licdn.com/dms/image/C4E03AQGF5G0CwaHShA/profile-displayphoto-shrink_200_200/0?e=1578528000&v=beta&t=KwGE1mCpIWzF8u83hNLBSxexQrpsm5EecHJ_tRl9GUA",
    "location": "Atlanta, Georgia",
    "connections": "500+",
    "summary": "Experienced talent acquisition leader building industry-leading software companies in security, cloud, machine learning, and mobile. Expert in sourcing, executive search, technical recruiting, and building high-performing, global, recruiting teams. Strong human resources, immigration, and employment law experience. Passionate about candidate experience and delivering for hiring managers."
  }
}