{
  "profileAlternative": {
    "name": "Sean Andrew",
    "headline": "SVP, Worldwide Corporate Sales at MongoDB, Inc at MongoDB",
    "imageurl": "https://media.licdn.com/dms/image/C4D03AQF57JfdE_1rjQ/profile-displayphoto-shrink_200_200/0?e=1578528000&v=beta&t=D6RJ0e8RB9sP9NCY-utDjZxJQ3UdR5MWEsxyA_Jah-E",
    "location": "Austin, Texas",
    "connections": "500+",
    "summary": "Results-oriented sales leader with over 15 years experience in software sales, organizational leadership, new business development, performance optimization, best practice and bench marking, channel development and product strategy.I am highly successful in building relationships externally and internally and with executive level decision makers both in business and IT, seizing control of critical factors and delivering on customer commitments. Demonstrated ability to hire, train and retain self motivated, customer orientated employees.\n\nSpecialties: I have experience in turnaround and rapid changing environments, extensive experience with complex software and technology requiring a deep understanding of business drivers in multiple markets and industries."
  },
  "aboutAlternative": {
    "text": "Results-oriented sales leader with over 15 years experience in software sales, organizational leadership, new business development, performance optimization, best practice and bench marking, channel development and product strategy.I am highly successful in building relationships externally and internally and with executive level decision makers both in business and IT, seizing control of critical factors and delivering on customer commitments. Demonstrated ability to hire, train and retain self motivated, customer orientated employees.\n\nSpecialties: I have experience in turnaround and rapid changing environments, extensive experience with complex software and technology requiring a deep understanding of business drivers in multiple markets and industries."
  },
  "positions": [
    {
      "title": "MongoDB",
      "location": "Austin, Texas Area",
      "date1": "Feb 2019 – Present",
      "date2": "10 mos",
      "roles": [
        {
          "title": "SVP, Worldwide Corporate Sales at MongoDB, Inc",
          "date1": "Feb 2019 – Present",
          "date2": "10 mos",
          "location": "Austin, Texas Area"
        },
        {
          "title": "Vice President, Worldwide Corporate Sales",
          "date1": "Feb 2016 – Present",
          "date2": "3 yrs 10 mos"
        }
      ]
    },
    {
      "title": "Title\nSVP, Worldwide Corporate Sales at MongoDB, Inc",
      "location": "Austin, Texas Area",
      "date1": "Feb 2019 – Present",
      "date2": "10 mos",
      "roles": [
        {
          "title": "SVP, Worldwide Corporate Sales at MongoDB, Inc",
          "date1": "Feb 2019 – Present",
          "date2": "10 mos",
          "location": "Austin, Texas Area"
        }
      ]
    },
    {
      "title": "Title\nVice President, Worldwide Corporate Sales",
      "date1": "Feb 2016 – Present",
      "date2": "3 yrs 10 mos",
      "roles": [
        {
          "title": "Vice President, Worldwide Corporate Sales",
          "date1": "Feb 2016 – Present",
          "date2": "3 yrs 10 mos"
        }
      ]
    },
    {
      "title": "Advisor to Telestax",
      "companyName": "TeleStax",
      "location": "Austin, Texas Area",
      "date1": "Feb 2018 – Present",
      "date2": "1 yr 10 mos"
    },
    {
      "title": "AppDynamics",
      "location": "houston, texas area",
      "description": "AppDynamics is the leading provider of application performance management for modern application architectures in both the cloud and the data center, delivering solutions for highly distributed, dynamic, and agile environments. Companies such as Netflix, Priceline, TiVo, and ZipRealty use AppDynamics to monitor, troubleshoot, diagnose, and scale production applications, and over 80,000 people have downloaded AppDynamics Lite, its free java troubleshooting solution. The company was recognized as a Gartner Cool Vendor in IT Operations Management and recently as a Visionary and Leader in the Gartner APM Magic Quadrant.\n\nI currently manage the corporate sales team responsible for driving revenue across US, EMEA, and APAC.\n\nA couple core directives are;\n\n- increasing ASP\n- increasing New Logo acquisition\n- ensuring both upsell and cross-sell of our holistic APM offering\n- decreasing Inside reps ramp time to productivity\n- ensuring we continually improve on customer support and excellence\n- meeting WW personnel hiring plan - grew the team over 400%\n- meeting renewal objectives\n\n…\nsee more",
      "date1": "Sep 2013 – Jan 2016",
      "date2": "2 yrs 5 mos",
      "roles": [
        {
          "title": "Vice President, Worldwide Commercial Account Sales",
          "date1": "Sep 2013 – Jan 2016",
          "date2": "2 yrs 5 mos"
        },
        {
          "title": "Sr Worlwide Commercial Accounts Sales Director",
          "date1": "2012 – Sep 2013",
          "date2": "1 yr",
          "location": "houston, texas area"
        }
      ]
    },
    {
      "title": "Title\nVice President, Worldwide Commercial Account Sales",
      "date1": "Sep 2013 – Jan 2016",
      "date2": "2 yrs 5 mos",
      "roles": [
        {
          "title": "Vice President, Worldwide Commercial Account Sales",
          "date1": "Sep 2013 – Jan 2016",
          "date2": "2 yrs 5 mos"
        }
      ]
    },
    {
      "title": "Title\nSr Worlwide Commercial Accounts Sales Director",
      "location": "houston, texas area",
      "description": "AppDynamics is the leading provider of application performance management for modern application architectures in both the cloud and the data center, delivering solutions for highly distributed, dynamic, and agile environments. Companies such as Netflix, Priceline, TiVo, and ZipRealty use AppDynamics to monitor, troubleshoot, diagnose, and scale production applications, and over 80,000 people have downloaded AppDynamics Lite, its free java troubleshooting solution. The company was recognized as a Gartner Cool Vendor in IT Operations Management and recently as a Visionary and Leader in the Gartner APM Magic Quadrant.\n\nI currently manage the corporate sales team responsible for driving revenue across US, EMEA, and APAC.\n\nA couple core directives are;\n\n- increasing ASP\n- increasing New Logo acquisition\n- ensuring both upsell and cross-sell of our holistic APM offering\n- decreasing Inside reps ramp time to productivity\n- ensuring we continually improve on customer support and excellence\n- meeting WW personnel hiring plan - grew the team over 400%\n- meeting renewal objectives\n\n…\nsee more",
      "date1": "2012 – Sep 2013",
      "date2": "1 yr",
      "roles": [
        {
          "title": "Sr Worlwide Commercial Accounts Sales Director",
          "date1": "2012 – Sep 2013",
          "date2": "1 yr",
          "location": "houston, texas area"
        }
      ]
    },
    {
      "title": "BMC Software",
      "description": "Responsible for leading all sales specialists for BMC's solution offerings across \"ITSM, Automation, Application management and Monitoring\" for North and South America.",
      "date1": "Apr 2011 – Aug 2012",
      "date2": "1 yr 5 mos",
      "roles": [
        {
          "title": "Sales Director - Specialization for the Americas",
          "date1": "Apr 2011 – Aug 2012",
          "date2": "1 yr 5 mos"
        },
        {
          "title": "Area Sales Director for North America",
          "date1": "Apr 2007 – Mar 2011",
          "date2": "4 yrs"
        },
        {
          "title": "Regional Sales Manager",
          "date1": "Jun 2006 – Apr 2007",
          "date2": "11 mos"
        },
        {
          "title": "Distributed Service Assurance Specialist",
          "date1": "Mar 2004 – Jun 2006",
          "date2": "2 yrs 4 mos"
        }
      ]
    },
    {
      "title": "Title\nSales Director - Specialization for the Americas",
      "description": "Responsible for leading all sales specialists for BMC's solution offerings across \"ITSM, Automation, Application management and Monitoring\" for North and South America.",
      "date1": "Apr 2011 – Aug 2012",
      "date2": "1 yr 5 mos",
      "roles": [
        {
          "title": "Sales Director - Specialization for the Americas",
          "date1": "Apr 2011 – Aug 2012",
          "date2": "1 yr 5 mos"
        }
      ]
    },
    {
      "title": "Title\nArea Sales Director for North America",
      "description": "Manage a team tasked with prospecting and generating new customer revenue through out North America for BMC Software’s Service Assurance solutions.",
      "date1": "Apr 2007 – Mar 2011",
      "date2": "4 yrs",
      "roles": [
        {
          "title": "Area Sales Director for North America",
          "date1": "Apr 2007 – Mar 2011",
          "date2": "4 yrs"
        }
      ]
    },
    {
      "title": "Title\nRegional Sales Manager",
      "description": "Managed a team of account managers supporting BMC’s largest installed Service Assurance (distributed solutions) Enterprise accounts in the West and Southwest.",
      "date1": "Jun 2006 – Apr 2007",
      "date2": "11 mos",
      "roles": [
        {
          "title": "Regional Sales Manager",
          "date1": "Jun 2006 – Apr 2007",
          "date2": "11 mos"
        }
      ]
    },
    {
      "title": "Title\nDistributed Service Assurance Specialist",
      "description": "Top performing sales rep supporting BMC Software’s largest installed Service Assurance (Distributed solutions) accounts on the west coast.",
      "date1": "Mar 2004 – Jun 2006",
      "date2": "2 yrs 4 mos",
      "roles": [
        {
          "title": "Distributed Service Assurance Specialist",
          "date1": "Mar 2004 – Jun 2006",
          "date2": "2 yrs 4 mos"
        }
      ]
    },
    {
      "title": "Corporate Account Manager",
      "companyName": "WebVein Consulting",
      "description": "Six month contract to develop formal sales processes, marketing and advertising in order to grow and capitalize on the existing client base and new business.",
      "date1": "Jan 2002 – Aug 2002",
      "date2": "8 mos"
    }
  ],
  "educations": [],
  "skills": [
    {
      "title": "Sales Process",
      "count": "85"
    },
    {
      "title": "Enterprise Software",
      "count": "60"
    },
    {
      "title": "SaaS",
      "count": "54"
    }
  ],
  "recommendations": {
    "givenCount": "16",
    "receivedCount": "16",
    "given": [
      {
        "user": "https://www.linkedin.com/in/siaramahal/",
        "text": "I was hired by Sean to lead the EMEA Inside sales team in 2015. Sean is always a source of positive energy and an inspiring leader. What makes Sean different from other leaders is that he is intrinsically helpful and genuinely concerned for his team's welfare. Sean always seemed to have a solution, and always know what to say to inspire and reassure all his direct reports and wider team around him which got people to work together efficiently and effectively as a team. With his extreme focus in PG & MEDDIC he also established strategies, processes, and routines so that high performance was tangible. Sean is ranked as one of the best leaders and i hope i gain the opportunity to work with him again.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/iria-saleiro-1a123919/",
        "text": "I have worked with Sean for nearly 2 years and I have to say that he was such an aspirational leader. Even though Sean had a very busy schedule he always took the time to jump on a call if I had any issues or needed his help and support. Sean always find the right words to motivate you and always goes the extra miles to make sure you are motivated and happy. His work ethic is such an example for me. I hope to work with Sean in the future as it was an honour.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/prashi-singh/",
        "text": "I worked with Sean for 2 years at AppDynamics and he was one of the main reasons why I joined the company. He is an exceptional sales leader who works tirelessly. He has an extreme focus on PG and following MEDDICC process. His passion and focus on how he ran his business reflected in how I ran my deals and I was much more professional and successful because of it. He is a great role model, an inspirational leader, and supported his teams 100 percent! I will always look to Sean as a mentor and hope we get the opportunity to work together again.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/willcmay/",
        "text": "I was Sean's first hire at AppDynamics in 2012, so I had the privilege of working for him through the early stages of AppDynamics inside sales and its many iterations. Building and scaling a team to survive in a hyper-growth company like AppDynamics takes a real skill-set. To move from survival to success quarter over quarter, YoY, takes an elite skill-set. Sean built a successful team by driving a culture centered on collaboration and enablement. After that foundation, he engrained a world-class sales process (MEDDICC) into the operating rhythm of our team. From there, he elevated the team's productivity by driving \"maniacal PG\" across all inside sales functions. Through the many iterations of our sales GoToMarket, Sean helped keep the team focused on the bigger picture (building the next great software company, and helping reps like myself seize the opportunity at hand and grow into the next role). All in all, Sean is an amazing leader and great friend.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/stephen-haltom-0aaa4522/",
        "text": "As someone that didn't report directly to Sean, I was always blown away by his willingness to step outside of his role to coach me and help open up opportunities I never would have had otherwise. I could go to him with any issue and he always took the time to listen and share his thoughts. Sean is a one-of-a-kind leader who's energy, intelligence, and positive attitude inevitably make those around him better.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/anwestcott/",
        "text": "Sean is an exceptional leader and it's been an honour working with him at AppDynamics. His ability to continually motivate, ensure the following of water-tight qualification and adhering to a thorough sales process have helped me personally drive great results under his leadership. Sean always holds himself with the highest integrity, is a great role model, genuinely cares, and goes the extra mile for all those that work under or around him. He's never too busy to help, guide and support, no matter the situation. I have loved working with Sean and therefore hope our paths cross again in the future.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/cameron-essalat-96300913/",
        "text": "I have worked side by side with Sean for the past 2+ years helping to scale the Dallas sales office. As a transplant from the Bay Area to Dallas the #1 most important criteria for me was WHO my next sales leader would be. Sean has done nothing but exceed every criteria I had for my next manager including work ethic, mentorship, and sales execution. As a direct report to Sean I have been witness to his innate ability to be a Sales Leader and not just another Sales Manager - he cares just as much about exceeding quota (15 quarters in a row) as he does about you and your family’s well being. Sean has shown ALL on his team unconditional support and guidance with no boundaries since the beginning of my tenure at AppD. I will always look to Sean as a mentor and close friend.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/tim-koubek-6b47791/",
        "text": "Sean is one of the most selfless and most well accomplished leaders I have ever had the pleasure to manage. His focus on 1) people- from recruiting some of the best, to coaching and leading his team 2) Process and Product- Sean is a deep SME who is a student and teacher of our consistent sales process. He also collected information to better our product and feed it to PM. 3) Execution - Sean never missed a number. He made our team better with his curiosity and how he was always willing to help everyone- even when it didn't benefit him directly. . Preparation is the foundation of success and Sean is at the top of the list in the way he prepares. Sean is one of the best employees you could have- both from a culture and effectiveness standpoint.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/nelson-veiga-4963137/",
        "text": "Among the many deliverables Great Leaders provide is to provide their teams: Guidance, Clarity and Mentorship. During the time I was on Sean's team at BMC he delivered 100% of these and more. He's a person that connects with his \"people\", helps them structure a plan for success and removes obstacles that threaten execution. Simply put; Sean makes his teams Better, Faster Stronger than they really are and builds a foundation for their long term success....\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/greg-lesniewicz/",
        "text": "I had the pleasure of working for Sean for many years at BMC. He always made himself available to listen to all the moving parts of the challenges I was working on and provide sound guidance that helped me over achieve my goals consistently. He was a tremendous asset and helped me stay on task by leading by example. \"Take care of your clients or else someone else will\", Sean Andrew. He may have borrowed that from someone else but it stuck with me.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/ryan-precious-2aba5726/",
        "text": "Sean and I worked closely together building out AppDynamics Commercial Sales Team. A results orientated leader, who exceeded the WW Inside Sales target for 15 consecutive quarters. I've witnessed Sean not only excel at the core elements of his job (Recruit, Retain & Revenue) but also cross functional tasks that extended well beyond his sales leadership role (operations, go to market strategy and marketing). His direct contribution has grown the Commercial Sales Team 10x in under 4 years, has attracted and retained top talent, and internally promoted over a dozen top performers. Sean's most valuable traits transcend his outstanding results - inspirational and transformative leader who motives his team to maximize their potential.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/brent-leech-127a0/",
        "text": "Sean was my manager at BMC Software, and I am continually impressed with his excitement, passion and dedication to his career, his team and his company. His motivational skills and mentoring abilities were universally respected at BMC, and his ability to distill complex business issues into actionable components will serve him well in any organization. His stable guidance and business acumen will continue to make his teams successful, and I look forward to working with or for Sean again in the future.\n…\nSee more"
      }
    ],
    "received": [
      {
        "user": "https://www.linkedin.com/in/greg-lesniewicz/",
        "text": "I hired Greg onto my team early on in my management career as I was setting out to build an all star sales team.  Greg is just that, an all star, Greg is a truly exceptional account manager, with high energy; tons of charisma and proven ability to find and build true champions. Furthermore Greg truly exemplifies what it means to be a team player, constantly helping those around him and some one I could always rely on in a pinch when we needed to rally at the end of a quarter. \r\n\r\nI could not have been happier, when after a few years of crushing his goals. Greg was promoted to a field account manager. Just as he has excelled as an Sr sales specialist Greg went on to excel in the field role. \r\n\r\nIts been a pleasure watching Greg’s career to date, he is a rare find and some one that will always do the right thing along with what is needed to get the job done."
      },
      {
        "user": "https://www.linkedin.com/in/tim-moxness/",
        "text": "I hired Tim 3 years ago as I started to build out the NA commercial account team at AppD.  Tim is a truly exceptional account manager, with high energy; tons of charisma and proven ability to find and build true champions. Tim truly exemplifies what it means to be a team player, constantly helping those around him and some one I could always rely on in a pinch when we needed to rally at the end of a quarter. \r\n\r\nI could not have been happier, when after a couple years of crushing his goals. Tim was promoted to a Territory field account manager and relocated to Chicago. Just as he has excelled as a commercial account manager he continues to excel in the field role. Tim is a rare find and some one that will always do the right thing along with what is needed to get the job done."
      }
    ]
  },
  "accomplishments": [
    {
      "count": "1",
      "items": [
        "Afrikaans"
      ]
    },
    {
      "count": "1",
      "items": [
        "Big Brother & Big sister organization"
      ]
    }
  ],
  "peopleAlsoViewed": [
    {
      "user": "https://www.linkedin.com/in/bkmccarthy/",
      "text": "Senior Vice President of Worldwide Sales"
    },
    {
      "user": "https://www.linkedin.com/in/brentzaal/",
      "text": "Regional Director, Corporate Sales at MongoDB || We are HIRING Account Executives!"
    },
    {
      "user": "https://www.linkedin.com/in/grahamseamans/",
      "text": "Regional Director, Enterprise Sales @ MongoDB - Hiring Great People!"
    },
    {
      "user": "https://www.linkedin.com/in/carlyemery/",
      "text": "Senior Sales Recruiter at MongoDB - I'M HIRING!"
    },
    {
      "user": "https://www.linkedin.com/in/tjcooley/",
      "text": "VP WW Sales - We are hiring!"
    },
    {
      "user": "https://www.linkedin.com/in/mtwitty/",
      "text": "Vice President of Sales"
    },
    {
      "user": "https://www.linkedin.com/in/katrinamoldskred/",
      "text": "Sr. Sales Recruiter at Workday"
    },
    {
      "user": "https://www.linkedin.com/in/jpbolen/",
      "text": "VP Sales, West & Central"
    },
    {
      "user": "https://www.linkedin.com/in/gigi-neuenfeldt-91504437/",
      "text": "Director NA Sales Development - HIRING the future top closers @ MongoDB"
    },
    {
      "user": "https://www.linkedin.com/in/alanchhabra/",
      "text": "SVP, WW Partners + SVP, Asia at MongoDB"
    }
  ],
  "volunteerExperience": [
    {
      "title": "Big brother .,",
      "experience": "Big Brothers Big Sisters of America"
    }
  ],
  "profile": {
    "name": "Sean Andrew",
    "headline": "SVP, Worldwide Corporate Sales at MongoDB, Inc at MongoDB",
    "imageurl": "https://media.licdn.com/dms/image/C4D03AQF57JfdE_1rjQ/profile-displayphoto-shrink_200_200/0?e=1578528000&v=beta&t=D6RJ0e8RB9sP9NCY-utDjZxJQ3UdR5MWEsxyA_Jah-E",
    "location": "Austin, Texas",
    "connections": "500+",
    "summary": "Results-oriented sales leader with over 15 years experience in software sales, organizational leadership, new business development, performance optimization, best practice and bench marking, channel development and product strategy.I am highly successful in building relationships externally and internally and with executive level decision makers both in business and IT, seizing control of critical factors and delivering on customer commitments. Demonstrated ability to hire, train and retain self motivated, customer orientated employees.\n\nSpecialties: I have experience in turnaround and rapid changing environments, extensive experience with complex software and technology requiring a deep understanding of business drivers in multiple markets and industries."
  }
}