{
  "profileAlternative": {
    "name": "Susan Hammock Hollon",
    "headline": "Vice Regional Sales Trainer at NVR Homes and Owner, ICBIY Yogurt and Java coast Coffee",
    "location": "Cincinnati, Ohio Area",
    "connections": "39"
  },
  "aboutAlternative": {},
  "positions": [
    {
      "title": "Owner",
      "companyName": "ICBIY Yogurt and Java coast Coffee"
    },
    {
      "title": "Vice President of Sales and Marketing M/I Homes",
      "companyName": "M/I Homes",
      "date1": "May 2008 – Present",
      "date2": "11 yrs 7 mos"
    },
    {
      "title": "Regional Sales Trainer",
      "companyName": "NVR Inc.",
      "date1": "Oct 1998 – Jan 2008",
      "date2": "9 yrs 4 mos"
    },
    {
      "title": "Sales and Marketing Representative",
      "companyName": "NVR Inc., Ryan Homes",
      "date1": "1997 – 2008",
      "date2": "11 yrs"
    },
    {
      "title": "Regional Trainer",
      "companyName": "Ryan Homes",
      "date1": "1998 – 2007",
      "date2": "9 yrs"
    },
    {
      "title": "Vice President of Sales",
      "companyName": "Clayton Homes",
      "date1": "2004 – 2005",
      "date2": "1 yr"
    }
  ],
  "educations": [
    {
      "title": "Wichita State University",
      "degree": "BA",
      "fieldofstudy": "Education",
      "date1": "1982",
      "date2": "1986"
    }
  ],
  "skills": [],
  "recommendations": {
    "givenCount": "7",
    "receivedCount": "4",
    "given": [
      {
        "user": "https://www.linkedin.com/in/ashley-bermel-7624273/",
        "text": "Susan Hollon was perhaps one of the most incredible colleagues I've ever had the opportunity to work with. She is a tenacious leader and possesses a unique ability to turn every situation into a positive situation. Susan Hollon always exhibits incredible energy and effort, which I found to be very motivating while training at NVR Homes. Susan was very instrumental for introducing new techniques to engage potential clients and ways to complete the sales process. I gained a wealth of knowledge and confidence from training with Susan Hollon. She is an asset to NVR Homes.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/angieguinn/",
        "text": "Susan possess an extremely positive attitude, her passion and enthusiasm are contagious! She is a leader with the ability to motivate, coach and mentor associates. Her talent and determination assists her in overcoming any challenge. She is a valuable asset to any team!"
      },
      {
        "user": "https://www.linkedin.com/in/melisas/",
        "text": "Susan Hollon is an amazing and dynamic trainer! I have worked directly with her and been a participant in training classes. She makes the learning process fun by involving the participants in activities to keep them involved. Susan is full of energy and conviction and displays that in her daily life, she is a motivator, team player, and friend. She is a true asset to any company!\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/johnmaccauley/",
        "text": "Susan is an incredible teammate and co-worker and so many things stood out about Susan. She was respected and loved by the entire Region. Her energy was infectious and I could never get enough of her time to coach and mentor my sales team. I wish I could get Susan to transfer to Nashville so we could work together again. She makes everything and everyone around her better. Without a doubt Susan had the best attitude and approach of anyone I have ever worked with.\n…\nSee more"
      }
    ],
    "received": [
      {
        "user": "https://www.linkedin.com/in/jennafletcher/",
        "text": "I would like to take this time to recognize outstanding efforts and support Jenna provided to our Cincinnati Division. Jenna immediate response to my needs and follow  up was always greatly appreciated.\r\nThank you,'\r\nSusan Hollon"
      },
      {
        "user": "https://www.linkedin.com/in/juliacunningham/",
        "text": "Julia is an outstanding individual and it is with great pleasure to reccommned her. I worked very closely with Julia developing a business plan to meet Quota and achieve goals. She has an infectious personality and brings strength to any team or task at hand"
      }
    ]
  },
  "accomplishments": [],
  "peopleAlsoViewed": [],
  "volunteerExperience": [],
  "profile": {
    "name": "Susan Hammock Hollon",
    "headline": "Vice Regional Sales Trainer at NVR Homes and Owner, ICBIY Yogurt and Java coast Coffee",
    "location": "Cincinnati, Ohio Area",
    "connections": "39"
  }
}