{
  "profileAlternative": {
    "name": "Tomas Antona",
    "headline": "Animator, Designer and HTML 5 Banner Developer",
    "imageurl": "https://media.licdn.com/dms/image/C5603AQH_xzUu3ELzkQ/profile-displayphoto-shrink_200_200/0?e=1578528000&v=beta&t=2JYj4sBmsPqu-7QkfkOd6C9zVX5dOWNzZ6cDWJZ3cSQ",
    "location": "Raleigh-Durham, North Carolina Area",
    "connections": "297",
    "summary": "I've worked on hundreds of online experiences for musicians and movies and brands. I've designed and developed websites and micro-sites and prototypes and e-learning sites. I've illustrated beer labels and picture disks and posters. I drove a yellow cab in New York. I was a congressional intern in Washington. I made 10 albums and toured the world with an underground band called Alice Donut. I'm the father of two fantastic kids."
  },
  "aboutAlternative": {
    "text": "I've worked on hundreds of online experiences for musicians and movies and brands. I've designed and developed websites and micro-sites and prototypes and e-learning sites. I've illustrated beer labels and picture disks and posters. I drove a yellow cab in New York. I was a congressional intern in Washington. I made 10 albums and toured the world with an underground band called Alice Donut. I'm the father of two fantastic kids."
  },
  "positions": [
    {
      "title": "Interactive Designer",
      "companyName": "Freelance, self-employed",
      "location": "Durham, NC",
      "description": "KrispyKreme, Cree, Lenovo, Burts Bees, Kioti, Corian, NC Solar, TradingScreen, The Rachel Maddow Show",
      "date1": "Dec 2015 – Present",
      "date2": "4 yrs"
    },
    {
      "title": "Interactive Production Artist",
      "companyName": "McKinney",
      "location": "Durham NC",
      "description": "Sherwin Williams, Nationwide, Sony, Audi, World of Coke, Polaris, Mizuno, Crocs, Virgin Atlantic, Qwest",
      "date1": "Jan 2006 – Nov 2015",
      "date2": "9 yrs 11 mos"
    },
    {
      "title": "Interactive Designer",
      "companyName": "Deep Focus",
      "location": "New York City",
      "description": "Universal Music Group, HBO, Interscope, MGM, Miramax, AOL, Sony Playstation, Atari",
      "date1": "Feb 2004 – Dec 2005",
      "date2": "1 yr 11 mos"
    }
  ],
  "educations": [
    {
      "title": "Columbia University in the City of New York",
      "degree": "BA",
      "fieldofstudy": "Philosophy"
    }
  ],
  "skills": [
    {
      "title": "Flash",
      "count": "32"
    },
    {
      "title": "Animation",
      "count": "27"
    },
    {
      "title": "Interactive Advertising",
      "count": "23"
    },
    {
      "title": "Art Direction",
      "count": "20"
    },
    {
      "title": "Digital Media",
      "count": "13"
    },
    {
      "title": "Banners",
      "count": "13"
    },
    {
      "title": "Interaction Design",
      "count": "9"
    },
    {
      "title": "Film",
      "count": "9"
    },
    {
      "title": "Web Design",
      "count": "7"
    },
    {
      "title": "Advertising",
      "count": "6"
    },
    {
      "title": "User Experience",
      "count": "5"
    },
    {
      "title": "Flash Animation",
      "count": "4"
    },
    {
      "title": "Integrated Marketing",
      "count": "2"
    },
    {
      "title": "Creative Strategy",
      "count": "2"
    },
    {
      "title": "Digital Strategy",
      "count": "2"
    },
    {
      "title": "Information Architecture",
      "count": "1"
    },
    {
      "title": "ActionScript",
      "count": "12"
    },
    {
      "title": "Mac",
      "count": "3"
    },
    {
      "title": "Rich Media",
      "count": "18"
    },
    {
      "title": "Microsites",
      "count": "8"
    },
    {
      "title": "Interactive Media",
      "count": "6"
    },
    {
      "title": "Creative Direction",
      "count": "5"
    }
  ],
  "recommendations": {
    "givenCount": "3",
    "receivedCount": "8",
    "given": [
      {
        "user": "https://www.linkedin.com/in/bethmcknight/",
        "text": "Tomas is the kind of employee that every Manager hopes for. He is so dedicated to his craft and cares so deeply for putting the best creative work out into the world. Tomas has such a creative mind and is always looking for ways to improve upon the creative direction he’s given. At McKinney, he was a trusted partner for Art Directors when it came to animation style and execution. He is a funny, laid back, passionate, and interesting person that is a joy to work with and adds value to any team he is working with.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/noramishriky/",
        "text": "What I learned about Tomas after working with him for ten years at McKinney: 1. He’s a passionate artist, fearless contributor and devoted peer. 2. His mastery of motion design and animation turns the mundane into surprise and delight. 3. Insatiable curiosity and unrelenting dedication are his most reliable traits. 4. He loves to experiment and does so with sensibility and confidence.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/brandonwaring1/",
        "text": "Very few people receive the opportunity to work alongside passionate and creative individuals like Tomas. Even though we did not work directly together on projects, I had the pleasure of watching him produce great work as it unfolded. He has the unique ability of making animations vivid and lifelike. Profession aside, Tomas is a nice and laid-back guy loaded with amazing experiences and stories gained from his travels all over the world. He has a great attitude that never seems to quit and a contagious, spirit lifting laugh. I strongly believe that he would be a worthy addition to any digital team.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/jasonsawtelle/",
        "text": "Thomas is a whirlwind of creative energy. Working alongside him I was energized by his desire to one-up his last effort. With each project he always found a way to build something that felt fresh and new. It didn't take long before he was leading projects of his own. I will always appreciate his direct approach to creative projects. He always digs a little deeper for rationale and insight to help improve the work. Once you realize he has the valuable ability to be in tune with the target audience, his contributions will fast become a necessary component to your creative team.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/will-dean-36645835/",
        "text": "Tomas is a great artist and collaborator when it comes to all things digital. He and I worked together for nearly 7 years, and on every project he brought energy and skill that made the work better. He solves problems in a way that is creative and passionate, and takes the time to craft his work. He always brings a level of polish to even the smallest job. He's passionate about what he does- you can tell that he genuinely loves bringing ideas to life. Above that, he's a great guy to be around. Just a genuine, nice, approachable, low-ego, funny, solid dude. He's the type of guy you'd want to have on your team, regardless of the project. His positivity is the best!\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/megan-wade-31a2869/",
        "text": "Tomas is a first-rate animator and motion designer who always goes above and beyond. My creative teams often give me feedback like \"Tomas is the MAN!\" because he surprises and delights with every project. An art director will provide animation direction and Tomas delivers on that direction, plus a few added bonus versions that have his special touch. He's such an expert and has been doing it for so long that they almost always choose his version because he just innately knows what approach looks good and will work the best. Beyond his expertise, he's just an all-around nice guy with a great attitude, making him a welcome addition to any team.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/karaohalloran13/",
        "text": "Dedicated and driven is what comes to mind when I think about Tomas. I’ve had the pleasure of working with Tomas at McKinney for the last year. Above all, I was impressed with Tomas' ability to create stunning animations. He was always willing to go the extra mile to produce impressive work. And, of course, his warm personality and sense of humor was a welcome addition to the team. Tomas would be a true asset for any positions requiring the development of intricate and surprises animations and comes with my heartfelt recommendation.\n…\nSee more"
      },
      {
        "user": "https://www.linkedin.com/in/kristintillett/",
        "text": "I worked with Tomas at McKinney in the Interactive Studio for 4.5 years. He is an exceptional animator, motion designer, sound editor and developer. Tomas possesses an insatiable appetite to push above-average ideas further and the outcome is always greater than the team's and client's expectations. He is able to flawlessly produce that \"wow\" factor in his work – Art Directors and Creative Directors are consistently blown away by his approach with animation. Each of his animations tells a perfectly-timed story – one that unfolds like a scaled-down cinematic film and one that you'll want to play over and over again. In addition to all of that, he's a really nice, laid-back guy who takes criticism well, works hard and pushes himself further every day. I highly recommend Tomas for your next interactive project!\n…\nSee more"
      }
    ],
    "received": [
      {
        "user": "https://www.linkedin.com/in/megan-wade-31a2869/",
        "text": "A producer’s producer, Megan is absolutely stellar at her job.  For over 8 years, I’ve had the pleasure of working with Megan on dozens of projects.  She has the uncanny ability of keeping the team focused and calm and producing great work even under the tightest of deadlines.  She juggles timelines and personalities with grace and a fantastic sense of humor.  I recommend Megan wholeheartedly.  Any team would be lucky to have her."
      },
      {
        "user": "https://www.linkedin.com/in/karaohalloran13/",
        "text": "Energy, enthusiasm and grace under fire are how I think of Kara.  I’ve had the great fortune to work with Kara for over a year on a multiple projects.  She is a fantastic producer that knows how to get the best from both the people she works with and the projects she oversees.  Her dedication to detail is second to none.  And her sunny disposition keep the team working on all cylinders even under tight deadlines.  I give Kara my highest recommendation."
      }
    ]
  },
  "accomplishments": [
    {
      "count": "2",
      "items": [
        "English",
        "Spanish"
      ]
    }
  ],
  "peopleAlsoViewed": [
    {
      "user": "https://www.linkedin.com/in/davidsedeburn/",
      "text": "5 time award winning Html5 banner developer"
    },
    {
      "user": "https://www.linkedin.com/in/matthew-fleischman-759a78/",
      "text": "President, Data, Technology, Analytics and Insights at Publicis Media"
    },
    {
      "user": "https://www.linkedin.com/in/aaronepstein/",
      "text": "Display Advertising, HTML5 Banner Animator, Art Director, Motion Designer, Social Content Creator & Print Broker.."
    },
    {
      "user": "https://www.linkedin.com/in/chrisburkard/",
      "text": "Freelance Photographer"
    },
    {
      "user": "https://www.linkedin.com/in/matttt/",
      "text": "Creative Director @ Union"
    },
    {
      "user": "https://www.linkedin.com/in/unconventionalstylist/",
      "text": "Fashion Columnist at freelance writer,"
    },
    {
      "user": "https://www.linkedin.com/in/jonathanrosesf/",
      "text": "Director, Data Management & Analytics at Success Academy Charter Schools"
    },
    {
      "user": "https://www.linkedin.com/in/matthewpollock/",
      "text": "Using my Heart&Mind"
    },
    {
      "user": "https://www.linkedin.com/in/jamestortora/",
      "text": "Account Manager/Producer at CreativeDrive"
    },
    {
      "user": "https://www.linkedin.com/in/derekrichmond/",
      "text": "VP, Executive Producer at North Kingdom Design & Communication"
    }
  ],
  "volunteerExperience": [],
  "profile": {
    "name": "Tomas Antona",
    "headline": "Animator, Designer and HTML 5 Banner Developer",
    "imageurl": "https://media.licdn.com/dms/image/C5603AQH_xzUu3ELzkQ/profile-displayphoto-shrink_200_200/0?e=1578528000&v=beta&t=2JYj4sBmsPqu-7QkfkOd6C9zVX5dOWNzZ6cDWJZ3cSQ",
    "location": "Raleigh-Durham, North Carolina Area",
    "connections": "297",
    "summary": "I've worked on hundreds of online experiences for musicians and movies and brands. I've designed and developed websites and micro-sites and prototypes and e-learning sites. I've illustrated beer labels and picture disks and posters. I drove a yellow cab in New York. I was a congressional intern in Washington. I made 10 albums and toured the world with an underground band called Alice Donut. I'm the father of two fantastic kids."
  }
}